Revit 2027 API
RebarContainerParameterManager Methods
The RebarContainerParameterManager type exposes the following members.
Methods
Name | Description
AddOverride(ElementId, ElementId) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, Double) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, Int32) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddOverride(ElementId, String) |  Adds an override for the given parameter as its value will be displayed for the Rebar Container element.
AddSharedParameterAsOverride |  Adds a shared parameter as one of the parameter overrides stored by this Rebar Container element.
ClearOverrides |  Clears any overridden values from all parameters of the associated RebarContainer element.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDoubleOverrideValue |  Get the double value for an overriden parameter.
GetElementIdOverrideValue |  Get the ElementId value for an overriden parameter.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetIntOverrideValue |  Get the integer value for an overriden parameter.
GetStringOverrideValue |  Get the string value for an overriden parameter.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsOverriddenParameterModifiable |  Checks if overridden parameter is modifiable.
IsParameterOverridden |  Checks if the parameter has an override
IsRebarContainerParameter |  Checks if the parameter is a Rebar Container parameter
RemoveOverride |  Removes an overridden value from the given parameter.
SetOverriddenParameterModifiable |  Sets this overridden parameter to be modifiable.
SetOverriddenParameterReadonly |  Sets this overridden parameter to be readonly.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace